{
    "convoArray": [
        {
            "id": 0,
            "length": 20,
            "isAction": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false],
            "text": ["Oh? What do we have here? A quaint little fish shop.", "Oh! A little bear! Mon cher, how cute.", "And these goldfish... they're beautiful, les poissons rouges.", 
            "Oui! They're captivating, don't you think? So graceful...", "I used to come out to the pond just to watch them swim. Especially at night.", "Oui... the way the moonlight danced on the water, it was...", 
            "Magnifique.", "They are like tiny ballerinas, twirling under the stars.", "Oh, but you wouldn't understand, mon cher. It's an artist's vision.", "Every movement, every glint of moonlight--it is a dance in its own way.", 
            "Oh, but of course not. You are but a simple fisherman.", "But perhaps I can teach you my vision. I can teach you to see beauty.", "Oho! Well, that is a start, mon cher. We are in agreement there.", 
            "But alas, I cannot stay and chat. I have much to do.", "Mon cher, a lady mustn't reveal her secrets.", "I just thought I'd grace your little shop with my presence for a moment.", 
            "Consider yourself blessed.", "De rien! Such gratitude. You'll miss me, mon cher, I'm sure.", "Do try to find beauty while I'm gone, hm?", "Ciao!"],
            "options": ["Hello.", "", "Do you like goldfish?", "", "At night?", "", "", "", "", "Never thought of it like that.", "", "I see the beauty in fish.", "", "Like what?", 
            "", "", "... Thank you.", "", "", ""]
        },
        {
            "id": 1,
            "length": 21,
            "isAction": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false],
            "text": ["Ah, mon cher! I have arrived.", "Hello, hello. Today is your lucky day.", "I have decided I am here to teach you about beauty~", "Oui, beauty!", 
            "And what greater beauty is there than music and dance?", "Back in the day, I was a dancer, mon cher.", "Ballet. Grace, beauty, elegance--it was my life. My art.", 
            "You sound surprised. Can't you tell by my posture and elegance?", "A bit of an uncultured little bear, aren't we? No matter. I shall forgive you.", 
            "For me... I took to it like a fish to water.", "The music would begin, and the world would melt away.", "There's nothing quite like losing yourself in the melody.", 
            "And when I wasn't dancing, I was playing.", "The piano. Oh, mon cher, I was an utter virtuoso.", "My fingers danced across the keys just as my feet danced across the stage.", 
            "Ah... well, mon cher, c'est la vie.", "Life has a way of changing things.", "Oh, how I miss the arts. The feeling of the keys under my fingers, the stage under my feet...", 
            "Optimistic, mon cher. But... maybe. Who knows? Life is full of surprises, after all.", "Perhaps you're not as simple as I thought.", "De rien, mon cher."],
            "options": ["Hello again.", "", "Beauty?", "", "", "", "Ballet?", "Sure.", "", "", "", "", "Playing?", "", "Past tense?", "", "", "Maybe you'll play again", 
            "", "Thanks.", ""]
        },
        {
            "id": 2,
            "length": 28,
            "isAction": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false],
            "text": ["Mon cher, I've been thinking.", "About moi, of course. Who else?", "I've been thinking a lot about my time in dance... and the stage.", "You don't understand what it's like, do you? Being in the spotlight.", 
            "Being adored.", "It's intoxicating. The applause, the cheers...", "The way the crowd's attention is on you--and only you.", "In that fleeting moment, you are untouchable. Divine, even.", 
            "Mon cher, it's like the world is holding its breath for you.", "The stage is your pedestal.", "Happy...", "That's the thing, isn't it? I was... and I wasn't.", 
            "The spotlight... it illuminates you, yes... but it also blinds you.", "To everything else. To others. To yourself.", "I was vain beyond vain, mon cher.", 
            "The applause, the admiration...", "It gave me confidence, grace, purpose...", "It also made me selfish... lonely.", "Chasing perfection, chasing applause...", 
            "I left no space in my life for the people who truly mattered.", "And the audience... they love the performance, not... me.", "I flew too close to the sun, and I paid the price for it.", 
            "Regret... is such an ugly thing, isn't it?", "Non... I do not regret it. I cannot.", "Every moment under the spotlight, every stumble, every triumph...", 
            "It was a painful, humbling lesson.", "It made me stronger, mon cher...", "... even if it broke me first."],
            "options": ["About what?", "Of course.", "", "", "", "", "", "", "", "You must've been happy.", "", "", "Blinds you?", "", "", "", "", "", "", "", "", "Do you regret it?", "", "", "", "", "", ""]
        },
        {
            "id": 3,
            "length": 23,
            "isAction": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false],
            "text": ["Mon cher.", "Do you think it's true that time heals all wounds?", "Hmm...", "Sometimes.", "I had a serious injury, you know.", "It ended my career. Shattered everything I built.", 
            "Oh, don't pity me, mon cher. I've moved past the tears.", "But it was... hard. Not only the pain, but the loss.", 
            "It was a cruel twist of fate for a dancer to lose her wings.", "What good is a ballerina who cannot dance?", "I couldn't bear to look at myself in the mirror.", 
            "I couldn't even play the piano.", "It was. For a long time.", "But... I wonder why I can't feel it anymore.", "Oui. The pain. It's gone... completely.", 
            "Isn't that strange? No ache, no stiffness... nothing.", "I wonder if I can go back to dancing, mon cher.", "The stage, the lights, the music... perhaps it's waiting for me.", 
            "Do you think it's a foolish dream?", "Ah... mon cher is an optimistic little bear, hm?", "Maybe I'll try... just a little step.", "Maybe I still shine, hm?", 
            "Perhaps this is my second chance."],
            "options": ["Hello again.", "I think so.", "Sometimes things heal stronger than before.", "", "", "I'm sorry to hear that.", "", "", "", "", "", "That must've been hard.", 
            "", "The pain?", "", "", "", "", "It's not foolish.", "", "", "", ""]
        },
        {
            "id": 4,
            "length": 27,
            "isAction": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false],
            "text": ["Hello, mon cher.", "You never see the moon around here, do you?", "Ah, how tragic. Don't you ever miss it?", "Non? But isn't it so beautiful? It's adored by everyone.", 
            "People write songs, poems, even paint it.", "But... mon cher, how lonely must it be?", "Oui. The moon is always surrounded by stars but none are close.", 
            "No one truly knows it. It cannot reach out or be held.", "That's how I felt, mon cher. When I was on stage, under the spotlight...", "I was the moon.", "All eyes were on me. I was adored, praised... envied.", 
            "It was a dream... and a nightmare.", "The audience loves the performance, not the person.", "They love what you give them--a moment of beauty.", "As for friends... well...", 
            "When you chase perfection, there's little room for anything else.", "Support came from teachers, directors, peers... but it was all conditional.", "As long as I dazzled, they stayed.", 
            "I thrived like that for so long.", "But when I fell... my injury... everything was wiped away.", "No applause. No support. Just me and my reflection in the mirror.", 
            "It was hard, mon cher. Tragic.", "Adoration fades, the spotlight moves on.", "What remains is who you are when no one is watching.", "It's who you are without the spotlight.", 
            "But what remains when all you know is the spotlight?", "A lonely moon without her stars."],
            "options": ["Hello.", "No.", "Not really.", "", "", "Lonely?", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]
        },
        {
            "id": 5,
            "length": 18,
            "isAction": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false],
            "text": ["Mon cher... it's been coming back to me.", "My memories. Little pieces...", "The goldfish... I remember the goldfish.", "Like tiny stars swimming in the water.", 
            "It was a full moon.", "Like a spotlight on the water.", "I thought... perhaps, if I could just dance a little, I might feel beautiful again.", 
            "The moonlight was my spotlight, the goldfish my audience.", "For just a second... I felt invincible.", 
            "But... how fragile an illusion truly is.", "...", "I remember how cold it was underwater.", "I couldn't tell which way was up.", 
            "My spotlight was gone.", "My audience just kept darting around, oblivious.", "It was so... lonely.", "I spent my life performing, always reaching for perfection, bathed in the spotlight.", 
            "And in the end... I was the only one watching."],
            "options": ["What has?", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]
        },
        {
            "id": 6,
            "length": 15,
            "isAction": [false, false, false, false, false, false, false, false, false, false, false, false, false, true, true],
            "text": ["Oh, mon cher, there you are!", "Mon cher, something has changed. Something wonderful.", "A new road. It wasn't there before.", "It glows, soft like moonlight... almost as if it's calling to me.", 
            "Mon cher, I don't know where it leads but I have a feeling it's where I need to go.", "I believe I've lingered here long enough, don't you think?", "You've been such a kind little bear, mon cher.", 
            "Listening to me, indulging my vanity...", "Helping me realize that there is indeed beauty in the quiet moments.", "But now, it's time. I think I'm ready to take my final bow, mon cher.", 
            "Even now, I can hear the music. Faint, but clear, guiding me forward.", "Oh, I know you will, mon cher. Don't look so sad.", "For you--my final reverence.", 
            "She curtsies as though standing before an audience.", "She is as beautiful as the moon."],
            "options": ["Hello there.", "What?", "", "", "", "", "", "", "", "", "I'll miss you.", "", "", "", ""]
        }
    ]
}